stories/index.html
<!DOCTYPE html>
<html lang="en-us">

<head>
  <title>Stories | ii.nz</title>

  <meta name="ii" content="cool">
  <meta charset="UTF-8">
  <meta name="language" content="en">
  <meta name="description" content="">
  <meta name="keywords" content="">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta http-equiv="content-type" content="text/html; charset=utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">

  
  

  <link rel="shortcut icon" type="image/png" href="/favicon.ico" />


  
  
    
 
  
  

  

  
    
    <link type="text/css" rel="stylesheet" href="/css/post.min.2cdedeaee06d510cb6af67a8b95ad416aaefd78e2001e4f3e84bd07b2aa0e45d.css" integrity="sha256-LN7eruBtUQy2r2eouVrUFqrv144gAeTz6EvQeyqg5F0="/>
  
    
    <link type="text/css" rel="stylesheet" href="/css/custom.min.e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855.css" integrity="sha256-47DEQpj8HBSa&#43;/TImW&#43;5JCeuQeRkm5NMpJWZG3hSuFU="/>
  

  
   
  

<link rel='stylesheet' type='text/css' href='/ii-style.css'>
</head>

<body>
  <div class="burger__container">
  <div class="burger" aria-controls="navigation" aria-label="Menu">
    <div class="burger__meat burger__meat--1"></div>
    <div class="burger__meat burger__meat--2"></div>
    <div class="burger__meat burger__meat--3"></div>
  </div>
    <h1>ii.nz<span class="fancy">.</span></h1>
</div>


  <nav class="nav" id="navigation">
  <ul class="nav__list">
    
    
      <li>
        <a  href="/">home 🏠</a>
      </li>
    
      <li>
        <a  href="/about">about 🧄</a>
      </li>
    
      <li>
        <a  href="/post">posts 📜</a>
      </li>
    
      <li>
        <a  href="/stories">stories 🗨️ </a>
      </li>
    
  </ul>
</nav>


  <main>
    
    

    <div class="flex-wrapper">
      <div class="post__container">
        <div class="post">
          <header class="post__header">
            <div class="post__metadata">
              <h1 id="post__title">Stories</h1>
            </div>
          </header>
          <article class="post__content">
            

<blockquote>
<p>ii&#39;s stories, history, and talks</p>
</blockquote>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1"><a href="#headline-1" class="anchor">#</a>
2021 Kubecon NA Virtual
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>A talk on the tooling that has been used the community to bring Kubernetes Conformance coverage up to 77% by Stephen Heywood and Caleb Woodbine.</p>
<p>
Available as - <a href="https://www.youtube.com/watch?v=IQsBahak7PQ">video</a> - <a href="https://github.com/cncf/apisnoop/tree/90d10f828426c3c7d88ada1b3f66d3391c123258/docs/presentations/kubecon-2021-north-america">slides</a> - <a href="https://kccncna2021.sched.com/event/lV8X/conformance-testing-the-kubernetes-api-tooling-that-makes-the-difference-stephen-heywood-caleb-woodbine-iinz">sched</a></p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2"><a href="#headline-2" class="anchor">#</a>
2021 ii discusses the careers expo event
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>In Tauranga, there was a careers expo for students and the public to attend. At the event, ii a had a booth to invoke discussion on things such as cloud, Open Source, and technology.</p>
<p>
After the event was over over, ii and related folks joined together to discuss the event and how it went.</p>
<p>
Available as - <a href="https://vimeo.com/582634361">video</a> - <a href="https://hackmd.io/qMQxceJ6SWKa_mtx34aBfA?view">hackmd</a></p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3"><a href="#headline-3" class="anchor">#</a>
2021 Hippie + ii + local
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Similar to the talk to the Tauranga City council, this is a talk by Hippie Hacker in conversation with Priyanka Sharma [GM] of the CNCF.</p>
<p>
Available as - <a href="./presentations/2021-07-hippie-ii-local/index.html">slides</a></p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4"><a href="#headline-4" class="anchor">#</a>
2021 City Council
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>A talk to Tauranga City council by Hippie Hacker.</p>
<p>
Available as - <a href="https://youtu.be/mCIFcId1Yyk?t=4817">video</a> - <a href="./presentations/2021-06-city-council/index.html">slides</a></p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5"><a href="#headline-5" class="anchor">#</a>
2021 Kubecon EU Virtual
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>A talk on what Kubernetes Conformance is and how to contribute to it by Zach Mandeville and Caleb Woodbine.</p>
<p>
Available as - <a href="https://www.youtube.com/watch?v=05NMwOhD6Ks">video</a> - <a href="https://github.com/cncf/apisnoop/tree/9afb85e30be09709edd5e32201317f5ec09bc83d/docs/presentations/kubecon-2021-europe">slides</a> - <a href="https://kccnceu2021.sched.com/event/iE77/contributing-to-kubernetes-conformance-coverage-zach-mandeville-caleb-woodbine-iicoop-httpsiicoop">sched</a></p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6"><a href="#headline-6" class="anchor">#</a>
2020 Kubecon NA Virtual
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>A talk on Kubernetes Conformance coverage and how to contribute to it by Caleb Woodbine and Hippie Hacker.</p>
<p>
Available as - <a href="https://www.youtube.com/watch?v=8iSXMewnIzg">video</a> - <a href="https://github.com/cncf/apisnoop/tree/9afb85e30be09709edd5e32201317f5ec09bc83d/docs/presentations/kubecon-2020-north-america">slides</a> - <a href="https://kccncna20.sched.com/event/ekHw/contributing-to-kubernetes-conformance-coverage-hippie-hacker-caleb-woodbine-iicoop">sched</a></p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7"><a href="#headline-7" class="anchor">#</a>
2019 Kubecon NA - San Diego : K8s-Conformance &amp; Sig-Arch subgroup
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>A talk all about what the Kubernetes Conformance project by Dan Kohn, John Belameric, and Hippie Hacker.</p>
<p>
Available as - <a href="https://www.youtube.com/watch?v=hzZm5wX1tyQ">video</a> - <a href="https://kccncna19.sched.com/event/VyC7/k8s-conformance-sig-architecture-conformance-subgroup-hippie-hacker-iicoop-dan-kohn-cncf-john-belamaric-google">sched</a></p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8"><a href="#headline-8" class="anchor">#</a>
2019 Kubecon NA - San Diego : Precisecly Defining Kubernetes The Path of Conformance
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>A talk describing the journey of Kubernetes Conformance, it&#39;s contributors, and the story of how the community got the the place it&#39;s in by Hippie Hacker.</p>
<p>
Available as - <a href="https://www.youtube.com/watch?v=H5J5MmG_XFg">video</a> - <a href="https://github.com/cncf/apisnoop/blob/main/org/presentations/KubeKohn-NA-2019.org#a-view-from-the-sky">slides</a> - <a href="https://kcsna2019.sched.com/event/XClW">sched</a></p>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9"><a href="#headline-9" class="anchor">#</a>
2018 KubeCon - Shanghai : Discovering the untold user stories of Kubernetes with applied anthropology
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>A story about tracing the developments of Kubernetes and the given contributors, gided by the use of a Māori pepeha lens by Hippie Hacker and Indigo Phillips.</p>
<p>
Available as - <a href="https://kccncchina2018english.sched.com/event/FuKl/discovering-the-untold-user-stories-of-kubernetes-with-applied-anthropology-hippie-hacker-indigo-phillips-iicoop">sched</a> - <a href="https://www.youtube.com/watch?v=D-mqeCQNvU0">video</a> - <a href="https://docs.google.com/presentation/d/1dPGAXCS9pSQe8ZIbKBaQX1VDr8YKx4Qj8rEA7OlUkH0/edit?usp=sharing">slides</a> - related video (hippie tries to explain maori concepts to sig-arch): <a href="https://youtu.be/HhvF_aQyrSI?t=1657">https://youtu.be/HhvF_aQyrSI?t=1657</a></p>
</div>
</div>
<div id="outline-container-headline-10" class="outline-2">
<h2 id="headline-10"><a href="#headline-10" class="anchor">#</a>
2017 Bay Waka : Local kid makes good on world stage
</h2>
<div id="outline-text-headline-10" class="outline-text-2">
<p>A newspaper article written by David Hart about ii, and Hippie Hacker and Denver Williams&#39;s trip to Berlin.</p>
<p>
Available as - <a href="https://issuu.com/baywaka/docs/bay_waka_-_issue_7_-_apr-jun_2017/44">article</a></p>
</div>
</div>


            
          </article>
          

 <div class="pagination">
  

  
    <a class="pagination__item" href="https://ii.nz/archives/">
      <span class="pagination__label"></span>
      <span class="pagination__title" >Archives</span>
    </a>
  
</div>

          
          <footer class="post__footer">
            


<div class="social-icons">
  
    
    
      <a class="social-icons__link" rel="me" title="GitLab"
         href="https://gitlab.com/ii"
         target="_blank" rel="noopener">
        <div class="social-icons__icon" style="background-image: url('https://ii.nz/svg/gitlab.svg')"></div>
      </a>
    
  
    
    
      <a class="social-icons__link" rel="me" title="GitHub"
         href="https://github.com/ii"
         target="_blank" rel="noopener">
        <div class="social-icons__icon" style="background-image: url('https://ii.nz/svg/github.svg')"></div>
      </a>
    
  
    
    
      <a class="social-icons__link" rel="me" title="Email"
         href="mailto:hello@ii.coop"
         target="_blank" rel="noopener">
        <div class="social-icons__icon" style="background-image: url('https://ii.nz/svg/email.svg')"></div>
      </a>
    
  
</div>

            <p>© 2023</p>
          </footer>
          </div>
      </div>
      
    </div>


  </main>

   

  
  <script src="/js/index.min.301a8b0870381bf76b3b5182e8966d363a0474281183439beb024d8b8228fc66.js" integrity="sha256-MBqLCHA4G/drO1GC6JZtNjoEdCgRg0Ob6wJNi4Io/GY=" crossorigin="anonymous"></script>
  
  
  <script src="https://unpkg.com/prismjs@1.20.0/components/prism-core.min.js"></script>

  
  <script src="https://unpkg.com/prismjs@1.20.0/plugins/autoloader/prism-autoloader.min.js"
    data-autoloader-path="https://unpkg.com/prismjs@1.20.0/components/"></script>

  


</body>

</html>
